flatplate_github/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.1;

vertices
(
    (0 0 0)    //0
    (1 0 0)    //1
    (1 1 0)    //2
    (0 1 0)    //3
    (0 0 0.1)  //4
    (1 0 0.1)  //5
    (1 1 0.1)  //6
    (0 1 0.1)  //7
// here are our new vertices
     (2 0 0)    //8
     (2 1 0)	//9
     (2 0 0.1)  //10
     (2 1 0.1)  //11 
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (20 80 1) simpleGrading (0.2 40 1)   //firstblock
    hex (1 8 9 2 5 10 11 6) (100 80 1) simpleGrading (6 40 1)   //secondblock
);

edges
(
);

boundary
(
    zeroGradientPlanes
    {
        type patch;
        faces
        (
            (1 5 4 0)       // block 1 bottom
            (8 9 11 10)    // block 2 exit plane
            (3 7 6 2)       //topface block 1
            (2 6 11 9)     //top face block2 
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)       //left side x=0
        );
    }
  plate
    {                                                                                                                                                                           type patch;
        faces
        (                                                                                                                                                                           (1 8 10 5) // bottom block 1
        );
   }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)         //block 1 z=0
            (4 5 6 7)         //block 2 z=0.1 back
            (1 2 9 8)        // block 2 z=0
            (5 10 11 6)      // block z= 0.1
        );
    }
);
mergePatchPairs
(
);
// ************************************************************************* //
